app/controllers/products_controller.rb

	def index
		# productsテーブルから最新順に作品を２０件取得する
		@products = Product.order('id ASC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20

	def show
		@product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

	def search
		@products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)
---
SELECT  `products`.* FROM `products` WHERE (title LIKE('美女')) LIMIT 20