app/controllers/reviews_controller.rb

	def new
		@product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

	def create
		@review = Review.create(create_params)
---
INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (1, 'イタリアから来た少年がまるこを口説く', 20, 'ryohei', '2016-01-10 07:35:32', '2016-01-10 07:35:32')