app/views/products/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
---
						<ul style="padding: 0">
							<% @product.reviews.each do |review| %>